text = input("请输入文本：\n")

text_len = len(text)

print("*" * text_len)

if text_len > 0:
    if text_len % 2 == 0:
        print("离离原上草，一岁一枯荣。野火烧不尽，春风吹又生。远芳侵古道，晴翠接荒城。又送王孙去，萋萋满别情。")
    if text_len % 3 == 0:
        print("故人西辞黄鹤楼，烟花三月下扬州。孤帆远影碧空尽，唯见长江天际流。")
    if text_len % 5 == 0:
        print("莫言下岭便无难，赚得行人错喜欢。政入万山围子里，一山放出一山拦。")
    if text_len % 7 == 0:
        print("白日依山尽，黄河入海流。欲穷千里目，更上一层楼。")
    if text_len % 11 == 0:
        print("床前明月光，疑是地上霜。举头望明月，低头思故乡。")
    if text_len % 13 == 0:
        print("小时不识月，呼作白玉盘。又疑瑶台镜，飞在青云端。仙人垂两足，桂树何团团。白兔捣药成，问言与谁餐？蟾蜍蚀圆影，大明夜已残。羿昔落九乌，天人清且安。阴精此沦惑，去去不足观。忧来其如何？凄怆摧心肝。")
    if text_len % 17 == 0:
        print("清明时节雨纷纷，路上行人欲断魂。借问酒家何处有？牧童遥指杏花村。")
    if text_len % 19 == 0:
        print("碧玉妆成一树高，万条垂下绿丝绦。不知细叶谁裁出，二月春风似剪刀。")